HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxEth_reg.h
/** \\brief  1274, Register 157 - Receive UDP Error Octet Counter Register */
#define ETH_RXUDP_ERROR_OCTETS /*lint --e(923)*/ (*(volatile Ifx_ETH_RXUDP_ERROR_OCTETS*)0xF001E274u)

/** \\brief  1230, Register 140 - Receive UDP Good Frame Counter Register */
#define ETH_RXUDP_GOOD_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_RXUDP_GOOD_FRAMES*)0xF001E230u)

/** \\brief  1270, Register 156 - Receive UDP Good Octet Counter Register */
#define ETH_RXUDP_GOOD_OCTETS /*lint --e(923)*/ (*(volatile Ifx_ETH_RXUDP_GOOD_OCTETS*)0xF001E270u)

/** \\brief  2014, Register 5 - Status Register */
#define ETH_STATUS /*lint --e(923)*/ (*(volatile Ifx_ETH_STATUS*)0xF001F014u)

/** \\brief  1704, Register 449 - Sub-Second Increment Register */
#define ETH_SUB_SECOND_INCREMENT /*lint --e(923)*/ (*(volatile Ifx_ETH_SUB_SECOND_INCREMENT*)0xF001E704u)

/** \\brief  1724, Register 457 - System Time - Higher Word Seconds Register */
#define ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS /*lint --e(923)*/ (*(volatile Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS*)0xF001E724u)

/** \\brief  170C, Register 451 - System Time - Nanoseconds Register */
#define ETH_SYSTEM_TIME_NANOSECONDS /*lint --e(923)*/ (*(volatile Ifx_ETH_SYSTEM_TIME_NANOSECONDS*)0xF001E70Cu)

/** \\brief  1714, Register 453 - System Time - Nanoseconds Update Register */
#define ETH_SYSTEM_TIME_NANOSECONDS_UPDATE /*lint --e(923)*/ (*(volatile Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE*)0xF001E714u)

/** \\brief  1708, Register 450 - System Time - Seconds Register */
#define ETH_SYSTEM_TIME_SECONDS /*lint --e(923)*/ (*(volatile Ifx_ETH_SYSTEM_TIME_SECONDS*)0xF001E708u)

/** \\brief  1710, Register 452 - System Time - Seconds Update Register */
#define ETH_SYSTEM_TIME_SECONDS_UPDATE /*lint --e(923)*/ (*(volatile Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE*)0xF001E710u)

/** \\brief  1720, Register 456 - Target Time Nanoseconds Register */
#define ETH_TARGET_TIME_NANOSECONDS /*lint --e(923)*/ (*(volatile Ifx_ETH_TARGET_TIME_NANOSECONDS*)0xF001E720u)

/** \\brief  171C, Register 455 - Target Time Seconds Register */
#define ETH_TARGET_TIME_SECONDS /*lint --e(923)*/ (*(volatile Ifx_ETH_TARGET_TIME_SECONDS*)0xF001E71Cu)

/** \\brief  1718, Register 454 - Timestamp Addend Register */
#define ETH_TIMESTAMP_ADDEND /*lint --e(923)*/ (*(volatile Ifx_ETH_TIMESTAMP_ADDEND*)0xF001E718u)

/** \\brief  1700, Register 448 - Timestamp Control Register */
#define ETH_TIMESTAMP_CONTROL /*lint --e(923)*/ (*(volatile Ifx_ETH_TIMESTAMP_CONTROL*)0xF001E700u)

/** \\brief  1728, Register 458 - Timestamp Status Register */
#define ETH_TIMESTAMP_STATUS /*lint --e(923)*/ (*(volatile Ifx_ETH_TIMESTAMP_STATUS*)0xF001E728u)

/** \\brief  2010, Register 4 - Transmit Descriptor List Address Register */
#define ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS /*lint --e(923)*/ (*(volatile Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS*)0xF001F010u)

/** \\brief  2004, Register 1 - Transmit Poll Demand Register */
#define ETH_TRANSMIT_POLL_DEMAND /*lint --e(923)*/ (*(volatile Ifx_ETH_TRANSMIT_POLL_DEMAND*)0xF001F004u)

/** \\brief  1138, Register 78 - Transmit Octet Count for Good and Bad 1024 to
 * Maxsize Bytes Frames */
#define ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD*)0xF001E138u)

/** \\brief  112C, Register 75 - Transmit Octet Count for Good and Bad 128 to
 * 255 Bytes Frames */
#define ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD*)0xF001E12Cu)

/** \\brief  1130, Register 76 - Transmit Octet Count for Good and Bad 256 to
 * 511 Bytes Frames */
#define ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD*)0xF001E130u)

/** \\brief  1134, Register 77 - Transmit Octet Count for Good and Bad 512 to
 * 1023 Bytes Frames */
#define ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD*)0xF001E134u)

/** \\brief  1124, Register 73 - Transmit Octet Count for Good and Bad 64 Byte
 * Frames */
#define ETH_TX_64OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD*)0xF001E124u)

/** \\brief  1128, Register 74 - Transmit Octet Count for Good and Bad 65 to 127
 * Bytes Frames */
#define ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD*)0xF001E128u)

/** \\brief  111C, Register 71 - Transmit Frame Count for Good Broadcast Frames */
#define ETH_TX_BROADCAST_FRAMES_GOOD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_BROADCAST_FRAMES_GOOD*)0xF001E11Cu)

/** \\brief  1144, Register 81 - Transmit Frame Count for Good and Bad Broadcast
 * Frames */
#define ETH_TX_BROADCAST_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD*)0xF001E144u)

/** \\brief  1160, Register 88 - Transmit Frame Count for Carrier Sense Error
 * Frames */
#define ETH_TX_CARRIER_ERROR_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_CARRIER_ERROR_FRAMES*)0xF001E160u)

/** \\brief  1154, Register 85 - Transmit Frame Count for Deferred Frames */
#define ETH_TX_DEFERRED_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_DEFERRED_FRAMES*)0xF001E154u)

/** \\brief  115C, Register 87 - Transmit Frame Count for Excessive Collision
 * Error Frames */
#define ETH_TX_EXCESSIVE_COLLISION_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES*)0xF001E15Cu)

/** \\brief  116C, Register 91 - Transmit Frame Count for Excessive Deferral
 * Error Frames */
#define ETH_TX_EXCESSIVE_DEFERRAL_ERROR /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR*)0xF001E16Cu)

/** \\brief  1168, Register 90 - Transmit Frame Count for Good Frames */
#define ETH_TX_FRAME_COUNT_GOOD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_FRAME_COUNT_GOOD*)0xF001E168u)

/** \\brief  1118, Register 70 - Transmit Frame Count for Good and Bad Frames */
#define ETH_TX_FRAME_COUNT_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD*)0xF001E118u)

/** \\brief  1158, Register 86 - Transmit Frame Count for Late Collision Error
 * Frames */
#define ETH_TX_LATE_COLLISION_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_LATE_COLLISION_FRAMES*)0xF001E158u)

